app/views/posts/index.html.erb

  <%= form_tag("/posts", method: "get") do %>
    <%= select_tag "author", options_from_collection_for_select(@authors.all, "id", "name"), include_blank: true %>
---
SELECT "authors".* FROM "authors"